<h3>Churn de Clientes - Bank Dataset</h3>

In [44]:
#Link do dataset - https://www.kaggle.com/datasets/mathchi/churn-for-bank-customers

#Descrição das variáveis
#RowNumber - Número da linha do dataset
#CustomerId - Número randômico e único que identifica o cliente
#Surname - Sobrenome do cliente
#CreditScore - Pontuação de crédito atribuida ao cliente
#Geography - Localização do cliente
#Gender - Gênero do cliente
#Age - Idade do cliente
#Tenure - Fidelidade do cliente | Quantidade de anos que o cliente está na instituição
#Balance - Saldo do cliente
#NumOfProducts - Quantidade de produtos que o cliente comprou no banco
#HasCrCard - Se o cliente possui ou não cartão de crédito sendo 1|Sim e 0|Não
#IsActiveMember - Se o cliente é ativo ou não no banco
#EstimatedSalary - Renda do cliente
#Exited - Se o cliente deixou ou não a instituição sendo 1|Sim e 0|Não

<h5>1. Importação dos pacotes </h5>

In [3]:
#Manipulação de dados
import pandas as pd
import numpy as np
import scipy.stats as st

#DataViz
import matplotlib.pyplot as plt
import seaborn as sns

#Machine Learning

<h5>2. Leitura e tratamento do dataset </h5>

In [13]:
df_original = pd.read_csv(filepath_or_buffer='churn.csv', header=0)
df_original.head()

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,3,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,4,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,5,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0

In [35]:
#Excluir colunas que não serão utilizadas
colunas_excluidas = {'RowNumber', 'CustomerId', 'Surname'}
#
df = df_original.drop(columns=colunas_excluidas)

In [36]:
#Criar lista com nome das novas variáveis
features = {
    'CustomerId': 'IdCliente',
    'CreditScore': 'ScoreCredito',
    'Geography': 'Localizacao',
    'Gender': 'Genero',
    'Age': 'Idade',
    'Tenure': 'TempoFidelidade',
    'Balance': 'Saldo',
    'NumOfProducts': 'QtdProdutos',
    'HasCrCard': 'TemCartao',
    'IsActiveMember': 'ClienteAtivo',
    'EstimatedSalary': 'SalarioEstimado',
    'Exited': 'Churn'
            }
#renomeando as variáveis
df.rename(columns=features, inplace=True)
#
df.head()

,ScoreCredito,Localizacao,Genero,Idade,TempoFidelidade,Saldo,QtdProdutos,TemCartao,ClienteAtivo,SalarioEstimado,Churn
0,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0

<h5>3. Análise Exploratória </h5>

In [37]:
#Informações sobre missing values e tipo das variáveis
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   ScoreCredito     10000 non-null  int64
 1   Localizacao      10000 non-null  object
 2   Genero           10000 non-null  object
 3   Idade            10000 non-null  int64
 4   TempoFidelidade  10000 non-null  int64
 5   Saldo            10000 non-null  float64
 6   QtdProdutos      10000 non-null  int64
 7   TemCartao        10000 non-null  int64
 8   ClienteAtivo     10000 non-null  int64
 9   SalarioEstimado  10000 non-null  float64
 10  Churn            10000 non-null  int64
dtypes: float64(2), int64(7), object(2)
memory usage: 859.5+ KB

In [42]:
#Estatísticas descritivas das variáveis numéricas
df.select_dtypes('number').describe().T

,count,mean,std,min,25%,50%,75%,max
ScoreCredito,10000.0,650.528800,96.653299,350.00,584.00,652.000,718.0000,850.00
Idade,10000.0,38.921800,10.487806,18.00,32.00,37.000,44.0000,92.00
TempoFidelidade,10000.0,5.012800,2.892174,0.00,3.00,5.000,7.0000,10.00
Saldo,10000.0,76485.889288,62397.405202,0.00,0.00,97198.540,127644.2400,250898.09
QtdProdutos,10000.0,1.530200,0.581654,1.00,1.00,1.000,2.0000,4.00
TemCartao,10000.0,0.705500,0.455840,0.00,0.00,1.000,1.0000,1.00
ClienteAtivo,10000.0,0.515100,0.499797,0.00,0.00,1.000,1.0000,1.00
SalarioEstimado,10000.0,100090.239881,57510.492818,11.58,51002.11,100193.915,149388.2475,199992.48
Churn,10000.0,0.203700,0.402769,0.00,0.00,0.000,0.0000,1.00

In [43]:
#Estatísticas descritivas das variáveis categóricas
df.select_dtypes('object').describe().T

             count unique     top  freq
Localizacao  10000      3  France  5014
Genero       10000      2    Male  5457

In [38]:
#Lista variáveis numéricas
df_numericas = df.select_dtypes('number').columns 
df_numericas

Index(['ScoreCredito', 'Idade', 'TempoFidelidade', 'Saldo', 'QtdProdutos',
       'TemCartao', 'ClienteAtivo', 'SalarioEstimado', 'Churn'],
      dtype='object')

In [39]:
#Lista variáveis categóricas
df_categoricas = df.select_dtypes('object').columns 
df_categoricas

Index(['Localizacao', 'Genero'], dtype='object')